testing/result/load_test_res.txt
█ TOTAL RESULTS

checks_total.......................: 111258  926.946533/s
checks_succeeded...................: 100.00% 111258 out of 111258
checks_failed......................: 0.00%   0 out of 111258

✓ get home page
✓ get signin page
✓ is signed in
✓ can get home
✓ create task success
✓ task done
✓ task undone
✓ task deleted
✓ is signed out

HTTP
http_req_duration.......................................................: avg=24.06ms min=57.03µs med=4.29ms   max=354.88ms p(90)=75.69ms  p(95)=115.92ms
    { expected_response:true }............................................: avg=24.06ms min=57.03µs med=4.29ms   max=354.88ms p(90)=75.69ms  p(95)=115.92ms
http_req_failed.........................................................: 0.00%  0 out of 111258
http_reqs...............................................................: 111258 926.946533/s

EXECUTION
iteration_duration......................................................: avg=217.7ms min=52.96ms med=185.73ms max=811.57ms p(90)=441.58ms p(95)=499.43ms
iterations..............................................................: 12362  102.994059/s
vus.....................................................................: 1      min=1           max=49
vus_max.................................................................: 50     min=50          max=50

NETWORK
data_received...........................................................: 174 MB 1.5 MB/s
data_sent...............................................................: 42 MB  350 kB/s



running (2m00.0s), 00/50 VUs, 12362 complete and 0 interrupted iterations
default ✓ [======================================] 00/50 VUs  2m0s